Channel_TopoCHT/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

Pr 0.7;
Prt 0.85;
alphaPorosityFluid 0.0;
alphaPorositySolid 1e3;
diffusivitySolid 1.4e-4;
pCoeff 2.0;
nu 1e-5;
TRef 300.0000000000000000;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
